import { Generator } from './generator';
import { Voiceover } from '../entities/voiceover';

describe('Generator', () => {
    let generator: Generator;

    beforeEach(() => {
        generator = new Generator();
    });

    describe('#generate', () => {

        it('should generate voiceovers by given numbers and dictionary', () => {
            const numbers = ['А001МН 78'];
            // noinspection NonAsciiCharacters
            const dictionary = {
                'А': ['а'],
                'М': ['эм', 'мэ'],
                'Н': ['эн'],
                '1': ['единица'],
                '7': ['семь'],
                '8': ['восемь'],
                '0': ['нуль', 'ноль'],
                ' ': ['регион'],
                '78': ['семьдесят восемь'],
                '00': ['два нуля', 'два ноля', 'дубль ноль']
            };

            const voiceovers = generator.generate(numbers, dictionary);

            expect(voiceovers).toEqual([
                { name: 'А001МН 78', options: ['а два ноля единица эм эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а два ноля единица мэ эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а два ноля единица эм эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а два ноля единица мэ эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а два нуля единица эм эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а два нуля единица мэ эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а два нуля единица эм эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а два нуля единица мэ эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а дубль ноль единица эм эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а дубль ноль единица мэ эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а дубль ноль единица эм эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а дубль ноль единица мэ эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а ноль ноль единица эм эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а ноль ноль единица мэ эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а ноль ноль единица эм эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а ноль ноль единица мэ эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а нуль ноль единица эм эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а нуль ноль единица мэ эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а нуль ноль единица эм эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а нуль ноль единица мэ эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а ноль нуль единица эм эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а ноль нуль единица мэ эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а ноль нуль единица эм эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а ноль нуль единица мэ эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а нуль нуль единица эм эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а нуль нуль единица мэ эн регион семьдесят восемь'] },
                { name: 'А001МН 78', options: ['а нуль нуль единица эм эн регион семь восемь'] },
                { name: 'А001МН 78', options: ['а нуль нуль единица мэ эн регион семь восемь'] }
            ] as Voiceover[]);
        });
    });
});